ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/USART/hal_uart_lld.h
#if GD32_UART_USE_USART1 && !GD32_HAS_USART1
#error "USART1 not present in the selected device"
#endif

#if GD32_UART_USE_USART2 && !GD32_HAS_USART2
#error "USART2 not present in the selected device"
#endif

#if GD32_UART_USE_USART3 && !GD32_HAS_USART3
#error "USART3 not present in the selected device"
#endif

#if GD32_UART_USE_UART4
#if !GD32_HAS_UART4
#error "UART4 not present in the selected device"
#endif

#if !defined(STM32F2XX) && !defined(STM32F4XX) && !defined(STM32L151xE)  && \
    !defined(STM32L152xE) && !defined(STM32L162xE)
#error "UART4 DMA access not supported in this platform"
#endif
#endif /* GD32_UART_USE_UART4 */

#if GD32_UART_USE_UART5
#if !GD32_HAS_UART5
#error "UART5 not present in the selected device"
#endif

#if !defined(STM32F2XX) && !defined(STM32F4XX) && !defined(STM32L151xE)  && \
    !defined(STM32L152xE) && !defined(STM32L162xE)
#error "UART5 DMA access not supported in this platform"
#endif
#endif /* GD32_UART_USE_UART5 */

#if GD32_UART_USE_USART6 && !GD32_HAS_USART6
#error "USART6 not present in the selected device"
#endif

#if GD32_UART_USE_UART7 && !GD32_HAS_UART7
#error "UART7 not present in the selected device"
#endif

#if GD32_UART_USE_UART8 && !GD32_HAS_UART8
#error "UART8 not present in the selected device"
#endif

#if !GD32_UART_USE_USART1 && !GD32_UART_USE_USART2 &&                     \
    !GD32_UART_USE_USART3 && !GD32_UART_USE_UART4 &&                      \
    !GD32_UART_USE_UART5  && !GD32_UART_USE_USART6 &&                     \
    !GD32_UART_USE_UART7  && !GD32_UART_USE_UART8
#error "UART driver activated but no USART/UART peripheral assigned"
#endif

#if GD32_UART_USE_USART1 &&                                                \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_USART1_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to USART1"
#endif

#if GD32_UART_USE_USART2 &&                                                \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_USART2_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to USART2"
#endif

#if GD32_UART_USE_USART3 &&                                                \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_USART3_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to USART3"
#endif

#if GD32_UART_USE_UART4 &&                                                 \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_UART4_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to UART4"
#endif

#if GD32_UART_USE_UART5 &&                                                 \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_UART5_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to UART5"
#endif

#if GD32_UART_USE_USART6 &&                                                \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_USART6_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to USART6"
#endif

#if GD32_UART_USE_UART7 &&                                                 \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_UART7_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to UART7"
#endif

#if GD32_UART_USE_UART8 &&                                                 \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_UART_UART8_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to UART8"
#endif

#if GD32_UART_USE_USART1 &&                                                \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_USART1_DMA_PRIORITY)
#error "Invalid DMA priority assigned to USART1"
#endif

#if GD32_UART_USE_USART2 &&                                                \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_USART2_DMA_PRIORITY)
#error "Invalid DMA priority assigned to USART2"
#endif

#if GD32_UART_USE_USART3 &&                                                \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_USART3_DMA_PRIORITY)
#error "Invalid DMA priority assigned to USART3"
#endif

#if GD32_UART_USE_UART4 &&                                                 \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_UART4_DMA_PRIORITY)
#error "Invalid DMA priority assigned to UART4"
#endif

#if GD32_UART_USE_UART5 &&                                                 \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_UART5_DMA_PRIORITY)
#error "Invalid DMA priority assigned to UART5"
#endif

#if GD32_UART_USE_USART6 &&                                                \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_USART6_DMA_PRIORITY)
#error "Invalid DMA priority assigned to USART6"
#endif

#if GD32_UART_USE_UART7 &&                                                 \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_UART7_DMA_PRIORITY)
#error "Invalid DMA priority assigned to UART7"
#endif

#if GD32_UART_USE_UART8 &&                                                 \
    !GD32_DMA_IS_VALID_PRIORITY(GD32_UART_UART8_DMA_PRIORITY)
#error "Invalid DMA priority assigned to UART8"
#endif

/* The following checks are only required when there is a DMA able to
   reassign streams to different channels.*/
#if GD32_ADVANCED_DMA
/* Check on the presence of the DMA streams settings in mcuconf.h.*/
#if GD32_UART_USE_USART1 && (!defined(GD32_UART_USART1_RX_DMA_STREAM) ||  \
                              !defined(GD32_UART_USART1_TX_DMA_STREAM))
#error "USART1 DMA streams not defined"
#endif

#if GD32_UART_USE_USART2 && (!defined(GD32_UART_USART2_RX_DMA_STREAM) ||  \
                              !defined(GD32_UART_USART2_TX_DMA_STREAM))
#error "USART2 DMA streams not defined"
#endif

#if GD32_UART_USE_USART3 && (!defined(GD32_UART_USART3_RX_DMA_STREAM) ||  \
                              !defined(GD32_UART_USART3_TX_DMA_STREAM))
#error "USART3 DMA streams not defined"
#endif

#if GD32_UART_USE_UART4 && (!defined(GD32_UART_UART4_RX_DMA_STREAM) ||    \
                             !defined(GD32_UART_UART4_TX_DMA_STREAM))
#error "UART4 DMA streams not defined"
#endif

#if GD32_UART_USE_UART5 && (!defined(GD32_UART_UART5_RX_DMA_STREAM) ||    \
                             !defined(GD32_UART_UART5_TX_DMA_STREAM))
#error "UART5 DMA streams not defined"
#endif

#if GD32_UART_USE_USART6 && (!defined(GD32_UART_USART6_RX_DMA_STREAM) ||  \
                              !defined(GD32_UART_USART6_TX_DMA_STREAM))
#error "USART6 DMA streams not defined"
#endif

#if GD32_UART_USE_UART7 && (!defined(GD32_UART_UART7_RX_DMA_STREAM) ||    \
                             !defined(GD32_UART_UART7_TX_DMA_STREAM))
#error "UART7 DMA streams not defined"
#endif

#if GD32_UART_USE_UART8 && (!defined(GD32_UART_UART8_RX_DMA_STREAM) ||    \
                             !defined(GD32_UART_UART8_TX_DMA_STREAM))
#error "UART8 DMA streams not defined"
#endif

/* Check on the validity of the assigned DMA channels.*/
#if GD32_UART_USE_USART1 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART1_RX_DMA_STREAM,                 \
                           GD32_USART1_RX_DMA_MSK)
#error "invalid DMA stream associated to USART1 RX"
#endif

