ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/USART/hal_uart_lld.h
#if GD32_UART_USE_USART1 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART1_TX_DMA_STREAM,                 \
                           GD32_USART1_TX_DMA_MSK)
#error "invalid DMA stream associated to USART1 TX"
#endif

#if GD32_UART_USE_USART2 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART2_RX_DMA_STREAM,                 \
                           GD32_USART2_RX_DMA_MSK)
#error "invalid DMA stream associated to USART2 RX"
#endif

#if GD32_UART_USE_USART2 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART2_TX_DMA_STREAM,                 \
                           GD32_USART2_TX_DMA_MSK)
#error "invalid DMA stream associated to USART2 TX"
#endif

#if GD32_UART_USE_USART3 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART3_RX_DMA_STREAM,                 \
                           GD32_USART3_RX_DMA_MSK)
#error "invalid DMA stream associated to USART3 RX"
#endif

#if GD32_UART_USE_USART3 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART3_TX_DMA_STREAM,                 \
                           GD32_USART3_TX_DMA_MSK)
#error "invalid DMA stream associated to USART3 TX"
#endif

#if GD32_UART_USE_UART4 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART4_RX_DMA_STREAM,                  \
                           GD32_UART4_RX_DMA_MSK)
#error "invalid DMA stream associated to UART4 RX"
#endif

#if GD32_UART_USE_UART4 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART4_TX_DMA_STREAM,                  \
                           GD32_UART4_TX_DMA_MSK)
#error "invalid DMA stream associated to UART4 TX"
#endif

#if GD32_UART_USE_UART5 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART5_RX_DMA_STREAM,                  \
                           GD32_UART5_RX_DMA_MSK)
#error "invalid DMA stream associated to UART5 RX"
#endif

#if GD32_UART_USE_UART5 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART5_TX_DMA_STREAM,                  \
                           GD32_UART5_TX_DMA_MSK)
#error "invalid DMA stream associated to UART5 TX"
#endif

#if GD32_UART_USE_USART6 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART6_RX_DMA_STREAM,                 \
                           GD32_USART6_RX_DMA_MSK)
#error "invalid DMA stream associated to USART6 RX"
#endif

#if GD32_UART_USE_USART6 &&                                                \
    !GD32_DMA_IS_VALID_ID(GD32_UART_USART6_TX_DMA_STREAM,                 \
                           GD32_USART6_TX_DMA_MSK)
#error "invalid DMA stream associated to USART6 TX"
#endif
#endif /* GD32_ADVANCED_DMA */

#if GD32_UART_USE_UART7 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART7_RX_DMA_STREAM,                  \
                           GD32_UART7_RX_DMA_MSK)
#error "invalid DMA stream associated to UART7 RX"
#endif

#if GD32_UART_USE_UART7 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART7_TX_DMA_STREAM,                  \
                           GD32_UART7_TX_DMA_MSK)
#error "invalid DMA stream associated to UART7 TX"
#endif

#if GD32_UART_USE_UART8 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART8_RX_DMA_STREAM,                  \
                           GD32_UART8_RX_DMA_MSK)
#error "invalid DMA stream associated to UART8 RX"
#endif

#if GD32_UART_USE_UART8 &&                                                 \
    !GD32_DMA_IS_VALID_ID(GD32_UART_UART8_TX_DMA_STREAM,                  \
                           GD32_UART8_TX_DMA_MSK)
#error "invalid DMA stream associated to UART8 TX"
#endif

#if !defined(GD32_DMA_REQUIRED)
#define GD32_DMA_REQUIRED
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   UART driver condition flags type.
 */
typedef uint32_t uartflags_t;

/**
 * @brief   Structure representing an UART driver.
 */
typedef struct UARTDriver UARTDriver;

/**
 * @brief   Generic UART notification callback type.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 */
typedef void (*uartcb_t)(UARTDriver *uartp);

/**
 * @brief   Character received UART notification callback type.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 * @param[in] c         received character
 */
typedef void (*uartccb_t)(UARTDriver *uartp, uint16_t c);

/**
 * @brief   Receive error UART notification callback type.
 *
 * @param[in] uartp     pointer to the @p UARTDriver object
 * @param[in] e         receive error mask
 */
typedef void (*uartecb_t)(UARTDriver *uartp, uartflags_t e);

/**
 * @brief   Driver configuration structure.
 * @note    It could be empty on some architectures.
 */
typedef struct {
  /**
   * @brief End of transmission buffer callback.
   */
  uartcb_t                  txend1_cb;
  /**
   * @brief Physical end of transmission callback.
   */
  uartcb_t                  txend2_cb;
  /**
   * @brief Receive buffer filled callback.
   */
  uartcb_t                  rxend_cb;
  /**
   * @brief Character received while out if the @p UART_RECEIVE state.
   */
  uartccb_t                 rxchar_cb;
  /**
   * @brief Receive error callback.
   */
  uartecb_t                 rxerr_cb;
  /* End of the mandatory fields.*/
  /**
   * @brief   Receiver timeout callback.
   * @details Handles idle interrupts depending on configured
   *          flags in CR registers and supported hardware features.
   */
  uartcb_t                  timeout_cb;
  /**
   * @brief Bit rate.
   */
  uint32_t                  speed;
  /**
   * @brief Initialization value for the CTL0 register.
   */
  uint16_t                  ctl0;
  /**
   * @brief Initialization value for the CTL1 register.
   */
  uint16_t                  ctl1;
  /**
   * @brief Initialization value for the CTL2 register.
   */
  uint16_t                  ctl2;
} UARTConfig;

/**
 * @brief   Structure representing an UART driver.
 */
struct UARTDriver {
  /**
   * @brief Driver state.
   */
  uartstate_t               state;
  /**
   * @brief Transmitter state.
   */
  uarttxstate_t             txstate;
  /**
   * @brief Receiver state.
   */
  uartrxstate_t             rxstate;
  /**
   * @brief Current configuration data.
   */
  const UARTConfig          *config;
#if (UART_USE_WAIT == TRUE) || defined(__DOXYGEN__)
  /**
   * @brief   Synchronization flag for transmit operations.
   */
  bool                      early;
  /**
   * @brief   Waiting thread on RX.
   */
  thread_reference_t        threadrx;
  /**
   * @brief   Waiting thread on TX.
   */
  thread_reference_t        threadtx;
#endif /* UART_USE_WAIT */
#if (UART_USE_MUTUAL_EXCLUSION == TRUE) || defined(__DOXYGEN__)
  /**
   * @brief   Mutex protecting the peripheral.
   */
  mutex_t                   mutex;
#endif /* UART_USE_MUTUAL_EXCLUSION */
#if defined(UART_DRIVER_EXT_FIELDS)
  UART_DRIVER_EXT_FIELDS
#endif
  /* End of the mandatory fields.*/
  /**
   * @brief Pointer to the USART registers block.
   */
  USART_TypeDef             *usart;
  /**
   * @brief Receive DMA mode bit mask.
   */
  uint32_t                  dmarxmode;
  /**
   * @brief Send DMA mode bit mask.
   */
  uint32_t                  dmatxmode;
  /**
   * @brief Receive DMA channel.
   */
  const gd32_dma_stream_t  *dmarx;
  /**
   * @brief Transmit DMA channel.
   */
  const gd32_dma_stream_t  *dmatx;
  /**
   * @brief Default receive buffer while into @p UART_RX_IDLE state.
   */
  volatile uint16_t         rxbuf;
};

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#if GD32_UART_USE_USART1 && !defined(__DOXYGEN__)
extern UARTDriver UARTD1;
#endif

#if GD32_UART_USE_USART2 && !defined(__DOXYGEN__)
extern UARTDriver UARTD2;
#endif

#if GD32_UART_USE_USART3 && !defined(__DOXYGEN__)
extern UARTDriver UARTD3;
#endif

#if GD32_UART_USE_UART4 && !defined(__DOXYGEN__)
extern UARTDriver UARTD4;
#endif

#if GD32_UART_USE_UART5 && !defined(__DOXYGEN__)
extern UARTDriver UARTD5;
#endif

#if GD32_UART_USE_USART6 && !defined(__DOXYGEN__)
extern UARTDriver UARTD6;
#endif

#if GD32_UART_USE_UART7 && !defined(__DOXYGEN__)
extern UARTDriver UARTD7;
#endif

#if GD32_UART_USE_UART8 && !defined(__DOXYGEN__)
extern UARTDriver UARTD8;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void uart_lld_init(void);
  void uart_lld_start(UARTDriver *uartp);
  void uart_lld_stop(UARTDriver *uartp);
  void uart_lld_start_send(UARTDriver *uartp, size_t n, const void *txbuf);
  size_t uart_lld_stop_send(UARTDriver *uartp);
  void uart_lld_start_receive(UARTDriver *uartp, size_t n, void *rxbuf);
  size_t uart_lld_stop_receive(UARTDriver *uartp);
#ifdef __cplusplus
}
#endif

#endif /* HAL_USE_UART */

#endif /* HAL_UART_LLD_H */

/** @} */
